; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-4degree-100mindistance-5trucks-4packages-919seed

(define (problem transport-two-cities-sequential-4nodes-1000size-4degree-100mindistance-5trucks-4packages-919seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 754,286 -> 693,532
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 26)
  ; 693,532 -> 754,286
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 26)
  ; 292,254 -> 693,532
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 49)
  ; 693,532 -> 292,254
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 49)
  ; 292,254 -> 754,286
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 47)
  ; 754,286 -> 292,254
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 47)
  ; 574,836 -> 693,532
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 33)
  ; 693,532 -> 574,836
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 33)
  ; 574,836 -> 754,286
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 58)
  ; 754,286 -> 574,836
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 58)
  ; 574,836 -> 292,254
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 65)
  ; 292,254 -> 574,836
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 65)
  ; 2407,111 -> 2966,126
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 56)
  ; 2966,126 -> 2407,111
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 56)
  ; 2051,653 -> 2407,111
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 65)
  ; 2407,111 -> 2051,653
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 65)
  ; 2641,244 -> 2966,126
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 35)
  ; 2966,126 -> 2641,244
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 35)
  ; 2641,244 -> 2407,111
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 27)
  ; 2407,111 -> 2641,244
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 27)
  ; 754,286 <-> 2051,653
  (road city-1-loc-2 city-2-loc-3)
  (= (road-length city-1-loc-2 city-2-loc-3) 135)
  (road city-2-loc-3 city-1-loc-2)
  (= (road-length city-2-loc-3 city-1-loc-2) 135)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-1)
  (at package-4 city-1-loc-2)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-3)
  (at truck-4 city-2-loc-3)
  (capacity truck-4 capacity-3)
  (at truck-5 city-2-loc-4)
  (capacity truck-5 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-4)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-5 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-5 city-2-loc-4)
   added: (at truck-5 city-2-loc-2)
   goals met: 0 of 4
2. (drive truck-5 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-5 city-2-loc-2)
   added: (at truck-5 city-2-loc-3)
   goals met: 0 of 4
3. (drive truck-5 city-2-loc-3 city-1-loc-2)
   deleted: (at truck-5 city-2-loc-3)
   added: (at truck-5 city-1-loc-2)
   goals met: 0 of 4
4. (pick-up truck-5 city-1-loc-2 package-4 capacity-3 capacity-4)
   deleted: (at package-4 city-1-loc-2) (capacity truck-5 capacity-4)
   added: (in package-4 truck-5) (capacity truck-5 capacity-3)
   goals met: 0 of 4
5. (drive truck-5 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-5 city-1-loc-2)
   added: (at truck-5 city-1-loc-3)
   goals met: 0 of 4
6. (pick-up truck-5 city-1-loc-3 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-3) (capacity truck-5 capacity-3)
   added: (in package-2 truck-5) (capacity truck-5 capacity-2)
   goals met: 0 of 4
7. (drive truck-5 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-5 city-1-loc-3)
   added: (at truck-5 city-1-loc-1)
   goals met: 0 of 4
8. (pick-up truck-5 city-1-loc-1 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-1) (capacity truck-5 capacity-2)
   added: (in package-3 truck-5) (capacity truck-5 capacity-1)
   goals met: 0 of 4
9. (pick-up truck-5 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-5 capacity-1)
   added: (in package-1 truck-5) (capacity truck-5 capacity-0)
   goals met: 0 of 4
10. (drive truck-5 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-5 city-1-loc-1)
   added: (at truck-5 city-1-loc-2)
   goals met: 0 of 4
11. (drive truck-5 city-1-loc-2 city-2-loc-3)
   deleted: (at truck-5 city-1-loc-2)
   added: (at truck-5 city-2-loc-3)
   goals met: 0 of 4
12. (drive truck-5 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-5 city-2-loc-3)
   added: (at truck-5 city-2-loc-2)
   goals met: 0 of 4
13. (drop truck-5 city-2-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-5) (capacity truck-5 capacity-0)
   added: (at package-1 city-2-loc-2) (capacity truck-5 capacity-1)
   goals met: 1 of 4
14. (drop truck-5 city-2-loc-2 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-5) (capacity truck-5 capacity-1)
   added: (at package-3 city-2-loc-2) (capacity truck-5 capacity-2)
   goals met: 2 of 4
15. (drop truck-5 city-2-loc-2 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-5) (capacity truck-5 capacity-2)
   added: (at package-4 city-2-loc-2) (capacity truck-5 capacity-3)
   goals met: 3 of 4
16. (drive truck-5 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-5 city-2-loc-2)
   added: (at truck-5 city-2-loc-4)
   goals met: 3 of 4
17. (drop truck-5 city-2-loc-4 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-5) (capacity truck-5 capacity-3)
   added: (at package-2 city-2-loc-4) (capacity truck-5 capacity-4)
   goals met: 4 of 4
